<!DOCTYPE html>
<!-- <html lang="en"> -->
<head>
    <meta charset="UTF-8">
    <meta name="keywords" content=" Backend-разработчик,Что должен знать Backend-разработчик" />
    <meta name="description" content="Кто такой Backend-разработчик его обязанности " />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="./css/styleFr.css">
    <title>Информационный портал</title>
</head>
<body>
<?php require "document.php/header.php"?>
<div class="container">
    <div class="backend">
        <h3>
            Backend-разработчик
        </h3>
        <p>
            Бэкенд-разработчики — специалисты,
            без которых не сможет нормально функционировать 
            ни один сайт или приложение. Инструменты, которыми вы 
            пользуетесь на ПК или смартфонах, сайты — все это результат
            работы целой команды специалистов.
        </p>
        <p>
            Программист по бэкенд-направлению занимается 
            внутренним обустройством продукта, организует
            работу приложения, сайтов, хранение данных,
            передачу информации пользователю и удобную 
            навигацию. Если разделить веб-продукт на две 
            части, то внешний вид — это работа фронтенд, а
            внутренний функционал и хранение данных — деятельность бэкенд.
        </p>
        <img class="backend_img" src="./img/fronted.jpg">
        <p>
            Бэкенд создает то, чем пользуются юзеры, но не напрямую. 
            Если говорить примерами, то форма ввода данных или 
            красивая корзина в интернет-магазине — это фронтенд-разработка, 
            а вот запись и хранение введенных данных, настройка платежных
            шлюзов, обновление контента — вот этим уже занимается бэкенд.
        </p>
        <h3>
             Обязанности бэкенд-программиста
        </h3>
        <p>
            В бэкенд-разработке есть перечень прямых обязанностей, 
            которые выполняет каждый специалист.
            Из часто встречающихся это:
        </p>
        <ul>
            <li>
                 работа с базами данных и их организация;
            </li>
            <li>
                 обеспечение корректного функционирования сайта;
            </li>
            <li>
                разработка алгоритмов для приложений;
            </li>
            <li>
                интеграция приложения или сайта с внешними сервисами;
            </li>
            <li>
                отладка компонентов;
            </li>
            <li>
                тестирование приложений, сайтов, конкретных элементов;
            </li>
            <li>
                создание API;
            </li>
            <li>
                оптимизация и расширение кода.
            </li>
        </ul>
        <p>
            В зависимости от сферы и опыта, число обязанностей
            бэкенд-программиста может расширяться. В итоге, если
            Backend-разработка изучена полностью, можно начать 
            осваивать frontend-разработку и стать специалистом 
            полного цикла.
        </p>
        <h3>
             Что должен знать Backend-разработчик
        </h3>
        <p>
            Список того, что должен знать Backend зависит 
            напрямую от деятельности и особенностей фирмы, куда устраивается 
            специалист. В зависимости от вакансии, могут 
            потребовать опыт в продажах, понимание работы 
            определенного оборудования и прочие навыки в 
            определенном направлении.
        </p>
        <p>
            Если сначала это кажется нелогичным, то при
            погружении в процесс обучения, приходит понимание, 
            что бекенд должен не просто написать код, а написать
            решение, которое будет подходить под конкретную нишу 
            продукта. Для этого нужно разбираться в определенных отраслях. 
        </p>
        <img class="backend_img2" src="./img/AdobeStock_237521842-1200x822-min-780x534.jpeg">
        <p>
            Специалист должен разрабатывать код в соответствии с нишей предприятия,
            погружаться в его работу и знать все тонкости. Не бывает двух 
            одинаковых кодов для разных фирм.
        </p>
        <p>
            Говоря о базовых требованиях, специалист,
            окончивший курсы по Backend-разработке, должен знать:
        </p>
        <ul>
            <li>
                один и более языков для серверного программирования, например Java, PHP, Python и пр.;
            </li>
            <li>
                API, SOAP или REST (последние два востребованы не так часто, как первый);
            </li>
            <li>
                как работают сервера;
            </li>
            <li>
                как пишутся юнит-тесты;
            </li>
            <li>
                об инструментах сетевой безопасности и основы их работы;
            </li>
            <li>
                веб-фреймворки.
            </li>
        </ul>
        <h3>
            Какие языки используются в Backend-программировании
        </h3>
        <p>
            Споры о том, на чем должен писать программист 
            по бэкенд направлению не прекращаются уже давно. 
            Портал wappalyzer.com опубликовал график самых популярных 
            языков, используемых в веб-приложениях.
        </p>
        <p>
            По графику видно, PHP до сих пор лидирует 
            по числу площадок, но могу сказать, что Java 
            и Python в последние года набирают обороты. 
            Разница в процентах обусловлена тем, что PHP долгое время 
            был царем в Backend-разработке, соответственно, другим языкам тяжело его догнать.
        </p>
        <img class="backend_img3" src="./img/Screenshot_6-min-16.jpg">
    </div>
</div>
<div class="footer">
    <div class="header">
         Информационный <br>портал
         <nav>
      <ul class=nav_link>
              <li><a href="index.php">Главная</a></li><br>
              <li><a href="indexHtml.php">HTML</a></li><br>
              <li><a href="indexCSS.php">CSS</a></li><br>
              <li><a href="indexJava.php">Java</a></li><br>
          </ul>
      </nav>
      <nav>
          <ul class=nav_link>
              <li><a href="indexJavaScript.php">JavaScript</a></li><br>
              <li><a href="indexPhp.php">PHP</a></li><br>
              <li><a href="indexPython.php">Python</a></li><br>
              <li><a href="indexMysql.php">Mysql</a></li><br>
          </ul>
      </nav>
      <form action="contact.php" method="POST">
            <input type="email" name="email" placeholder="Введите ваш email"><br>
            <input class="knopka" type="submit" submit="отправить">
      </form>
  </div>
</div>
<!-- <script src=./js/script.js></script> -->
<?php require "document.php/footer.php"?>
</body>
</html>