<!DOCTYPE html>
<!-- <html lang="en"> -->
<head>
    <meta charset="UTF-8">
    <meta name="keywords" content="Java,Зачем нужна Java, Java особенности" />
    <meta name="description" content="Что такое Java особенности" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="./css/styleJava.css">
    <title>JAVA</title>
</head>
<body>
<?php require "document.php/header.php"?>
<div class="container">
    <div class="java">
    <h3>
        Java
    </h3>
    <p>
        <strong>Java</strong> - это язык программирования, 
        то есть создания программ, выполняющих различные важные и
        второстепенные функции. Необходимо отметить, что JAVA - 
        это не только сам язык, но и платформа, на которой возможно
        создавать и использовать приложения, написанные на JAVA.
        Откуда пошло такое интересное название? JAVA - это сорт 
        кофе, которое весьма любим программистами. Мы также можем 
        наблюдать соответствующий названию логотип во многих приложениях JAVA.
    </p>
    <p>
        Назначение любого языка программирования сводится к тому, 
        чтобы написать программы для корректного и эффективного процесса
        работы любого электронного устройства. Изначально, JAVA создавался для того,
        чтобы управлять обычными бытовыми приборами. Одна
        создатели языка быстро поняли возможные перспективы своей работы и расширили 
        сферу своей деятельности.
    </p>
    <img class="java_img" src="./img/inner.jpg" alt="">
    <p>
        Сфера применения JAVA представляет собой следующую картину:
    </p>
    <ul>
        <li>
            Создание десктопов и апплетов. Данный продукт создается под заказ.
        </li>
        <li>
            Создание мобильных приложений. Отдельный мир программирования во вселенной JAVA.
        </li>
        <li>
            Различные серверные приложения, которые в основном ориентированы на работу с сетью.
        </li>
    </ul>
    <p>
        Особого упоминания требует такая черта языка JAVA, как универсальность. 
        Джеймс Гослинг - автор языка JAVA - говорит о том, что
        современное программирование смещается в сторону разработки 
        различных сетевых приложений. Ну а язык JAVA как нельзя лучше 
        отвечает этим современным требованиям. Универсальность языка, 
        как отмечает Гослинг, состоит в широте его применения. Вы можете 
        писать программы на JAVA для смарт-карт, для бортовых компьютеров,
        для сетевых приложений крупных организаций. И это только основные 
        направления работы с помощью JAVA.
    </p>
    <h3>
        Зачем нужна Java
    </h3>
    <p>
        Java - универсальный язык, который используют сотни тысяч 
        компаний. Так что если вы знаете Java, довольно легко найти 
        интересную работу. Java достаточно несложен в освоении, поэтому 
        он подходит тем, кто впервые подошёл к изучению программирования. 
        Этот язык работает на всех платформах, и хотя он постоянно обновляется и 
        модернизируется, старый Java-код совместим с новым.
    </p>
    <h3>
     Особенности Java
    </h3>
    <p>
        <em>Java является простым языком</em>. Java изначально был смоделирован с п
        одобия C и C ++, только убраны некоторые потенциально непонятные элементы.
        Указатели, множественное наследование реализации, а также перегрузка операторов 
        – эти некоторые C / C ++ функции не являются частью Java. Функция не является 
        обязательной в C / C ++, но необходима для Java – это сборщик мусора, который 
        автоматически высвобождает объекты и массивы.
    </p>
    <p>
        <em>Java является объектно-ориентированным языком</em>.
        Объектно-ориентированный фокус в Java позволяет 
        разработчикам работать над адаптацией Java, чтобы 
        решить проблему, а не заставлять нас манипулировать
        проблемой для удовлетворения языковых ограничений. 
        Этим он отличается от структурированного языка, как, 
        например, С. Например, в то время как Java позволяет 
        сосредоточиться на сберегательном счете объектов, 
        C требует, чтобы вы думали отдельно об экономии состояния счета 
        (такой баланс) и формах поведения (например, ввод и вывод).
    </p>
    <p>
        <em>Java позволяет работать с сетью</em>. Обширная сетевая библиотека 
        Java позволяет легко справиться с интернет-протоколом (TCP / IP), 
        а также такими сетевыми протоколами, как HTTP (Hypertext Transfer Protocol) 
        и FTP (File Transfer Protocol). С помощью библиотек задача создания сетевых
        соединений упрощается. Кроме того, Java программы могут получить доступ 
        к объектам через TCP / IP сети, с помощью унифицированных указателей
        информационных ресурсов (URL), с такой же легкостью, как и к файлам, 
         находящимся на локальном компьютере.
    </p>
    <img class="java_img2" src="./img/art181-2.jpg" alt="">
    <p>
        <em>Java является интерпретируемым языком</em>. Во время выполнения программы 
        Java косвенно выполняется на базовой платформе (например, Windows,
        или Linux) через виртуальную машину (которая представляет собой
        программное обеспечение представление гипотетической платформы) 
        и связанной с ним средой исполнения. Виртуальная машина переводит
        байт-код в программу Java-(инструкции и связанные с ними данные) 
        инструкции для конкретных платформ с помощью интерпретации. 
        Виртуальная машина затем выполняет эти инструкции на конкретной 
        платформе. Интерпретация облегчает отладку неработающих программ 
        Java, потому что при этом во время компиляции доступно больше информации.
    </p>
    <p>
        <em>Java является надежным языком</em>. Java программы должны быть 
        надежными, поскольку они используются в потребительских и 
        критически важных приложениях, начиная от Blu-Ray-плееры или
        систем воздушного контроля в автомобилях. Банковские клиенты и сервера 
        пишутся на этом языке. Особенности языка, которые помогают сделать Java надежным,
        включают в себя декларации, дублирование проверки типа во время компиляции и 
        выполнения (для предотвращения проблем несоответствия версий), массивы с 
        автоматической проверкой границ, отсутствие указателей.
    </p>
    </div>
</div>




<div class="footer">
    <div class="header">
         Информационный <br>портал
      <nav>
      <ul class=nav_link>
              <li><a href="index.php">Главная</a></li><br>
              <li><a href="indexHtml.php">HTML</a></li><br>
              <li><a href="indexCSS.php">CSS</a></li><br>
              <li><a href="indexJava.php">Java</a></li><br>
          </ul>
      </nav>
      <nav>
          <ul class=nav_link>
              <li><a href="indexJavaScript.php">JavaScript</a></li><br>
              <li><a href="indexPhp.php">PHP</a></li><br>
              <li><a href="indexPython.php">Python</a></li><br>
              <li><a href="indexMysql.php">Mysql</a></li><br>
          </ul>
      </nav>
      <form action="contact.php" method="POST">
            <input type="email" name="email" placeholder="Введите ваш email"><br>
            <input class="knopka" type="submit" submit="отправить">
      </form>
  </div>
</div>
<!-- <script src=./js/script.js></script> -->
<?php require "document.php/footer.php"?>
</body>
</html>