<!Doctype html>
<html>
<head>
	<link rel="stylesheet" type="text/css" href="./css/styleINDEX2.css">
	<title>Web-сайт</title>
	<meta charset="UTF-8">
</head>
<body>
<?php require "document/header.php" ?>
<div class="cont2">
	<h2>Кто-такой Web-разработчик</h2>
		<p class="h2_text1">Веб-разработчик — это специалист занимающийся написанием, обновлением, исправлением и совершенствованием алгоритмов для приложений, сайтов и отдельных элементов, с использованием разных языков программирования. Результат работы веб-разработчика — это интуитивно понятные и дружелюбные для пользователя цифровые продукты, которые мы используем в повседневной жизни.</p>
	<img id="img1" src="./img/home_3_about_page_intro_video_bg.jpg">
		<p class="h2_text">Слово «веб-разработчик» кажется вполне понятным — очевидно же, что он разрабатывает что-то для веба. На деле всё не так просто. Современный интернет мало похож на веб девяностых или нулевых: технологий столько, что уследить за всем сразу просто нереально. Поэтому в профессии веб-разработчика есть три больших специализации:</p>
		
		
	<h3>История профессии</h3>	
		<p  class="h2_text">Первые шаги в построении глобальной компьютерной сети были сделаны в 60-х годах XX века,
		а уже в 1969 году состоялся «премьерный» сеанс связи между двумя 
		удаленными ее абонентами. В последующие десятилетия Интернетом пользовалось 
		небольшое количество узких специалистов. Ситуация кардинально изменилась в начале
		90-х, когда в обиход вошли персональные компьютеры, а всеобщий доступ во Всемирную
		паутину обеспечили браузеры с хорошим интерфейсом (например, NCSA Mosaic). С тех пор 
		прошла только четверть века, а Интернетом пользуется уже больше половины населения Земли.
		Всемирная сеть проникла во все области человеческой деятельности, без нее не обойтись в 
		финансовой сфере, сервисе, коммуникациях и т. д. Массово стали возникать специальности, 
		связанные с информационными технологиями, одна из наиболее дефицитных среди них – программист сетевых ресурсов.</p>
		
		<p id="arial">Frontend-разработчик </p><p class="h2_text"> Программист, который создаёт интерфейс, видимую часть приложения. Она, как кассир в McDonald’s, берёт на себя общение с клиентом, принимает заказы. Когда мы заходим на сайты, мы обычно нажимаем на кнопки или отправляем товар в корзину. За всё это отвечает frontend. Нас не интересует, что там внутри, — главное, чтобы всё хорошо работало. Ну а если мобильная версия сайта по бокам вылезает за экран — виноват frontend-разработчик.</p>
		<p id="arial">Backend-разработчик </p><p class="h2_text"> Отвечает за внутренности, серверную часть сайта. Как повар в McDonald’s, он принимает заказы от кассира, готовит и передаёт обратно на кассу. Если вы поставили галочку напротив «китайские чайники до 2 000 рублей», а сайт показал гаечные ключи — передайте привет backend-разработчику.</p>
		<p id="arial">Fullstack-разработчик </p><p class="h2_text"> Многостаночник, который умеет и backend, и frontend. Как хозяин небольшого кафе, который принимает заказы, готовит и разносит еду. Делает он всё немного медленнее, а навыки до идеала прокачать сложно. Зато в курсе всех процессов — от и до. Опытные разработчики говорят, что в fullstack проще прийти из backend.</p><br>
		<p class="h2_text">Веб-разработка — самое популярное направление в программировании. Согласно исследованию Stack Overflow за 2020 год, большинство программистов считают себя frontend-, backend- или fullstack-разработчиками. Но лидируют в рейтинге те, кто занимается бэкендом.</p>
	<img  src="./img/234234.png">
		<p class="h2_text">Это подтверждает и опрос о самых популярных технологиях среди программистов: так или иначе связанные с вебом лидируют с большим отрывом. А на первом месте здесь JavaScript — его использует почти 70% веб-разработчиков в мире.</p>
	<img  src="./img/234234234.png">
		<h3>Что нужно знать Web-разработчику</h3>
			<p class="h2_text">Веб разработчику нужно знать, что современный сайт – это прежде всего средство достижения определенного результата, и для всех успешных сайтов – этот результат коммерческий. Клиент приходит к разработчику не за сайтом, или веб приложением, как за таковым, а за тем, чтобы решить свои проблемы в информационном поле.</p>
		
		<h3>Обязанности на работе</h3>
			<p class="h2_text">Веб-программист работает с софтом, соблюдая примерно следующий алгоритм деятельности:</p>
		<ul class="h2_text">
			<li>олучение от заказчика задачи, прояснение ее целей;</li>
			<li>совместная с дизайнерами, менеджерами, маркетологами проработка деталей;</li>
			<li>написание необходимых программ, которые обеспечат функционирование ресурса;</li>
			<li>составление технической документации;</li>
			<li>тестирование сайта, выявление и устранение недоработок и багов;</li>
			<li>запуск проекта и его презентация клиенту;</li>
			<li>дальнейшее сопровождение и обновление ресурса (по договоренности с заказчиком)</li>
		</ul>
		
			<p class="h2_text">Для качественного выполнения поставленной задачи хороший web-разработчик должен:</p>
		<ul class="h2_text">
			<li>работать с одним, а лучше с несколькими языками программирования (PHP, JavaScript, Ruby, Perl, C++), особенно важно это для создателей бек-энда;</li>
			<li>уметь использовать крупные базы данных;</li>
			<li>знать HTML, CSS, jQuery, различные фреймворки (например, Bootstrap, Yii или Foundation);</li>
			<li>хорошо владеть техническим английским языком, а для работы с иностранными клиентами, и разговорным.</li>
			<li>составление технической документации;</li>	
		</ul>
		
		<H3>Как построить карьеру</h3>
			<p class="h2_text">Веб-разработку многие относят к профессии мечты: 
			человек занимается любимым делом и получает за это 
			неплохие деньги. Чем выше уровень специалиста, тем более 
			выгодные заказы он получает. Работая в составе компании и 
			обладая помимо специальных знаний еще и организаторскими способностями,
			сотрудник может стать руководителем подразделения,
			отвечающего за софт, или, например, IT-директором. Неплохой вариант – 
			сколотить свою команду и открыть ИТ-фирму.</p>
		
		
		<h3>Веб-разработчику НЕ требуется:</h3>
			<ol class="h2_text">
				<li>Знать математику — большинству профессиональных программистов достаточно знаний на уровне пятого класса.</li>
				<li>Глубоко разбираться в английском языке. Сотни слов вполне хватит, а все остальные легко поддаются изучению онлайн.</li>
				<li>Учиться несколько лет и заканчивать институт, чтобы освоить базовую веб-разработку. На деле освоение профессии займет два-три месяца обучения.</li>
			</ol>
		<h3>Что понадобится для успешного старта:</h3>
			<ol>
				<li>Изучить базовые технологии создания сайтов — HTML и CSS — и понять принципы построения структуры сайтов. На это уйдёт несколько недель.</li>
				<li>Освоить сопутствующие технологии: редакторы кода либо IDE (интегрированные среды разработки), например Notepad++, Sublime Text, Brackets, WebStorm, PHPStorm. Эти инструменты сильно ускорят процесс разработки.</li>
				<li>Знать о существовании фреймворков и готовых решений, они упрощают и улучшают код. Например, для frontend-разработчика это фреймворк для верстки Bootstrap, библиотека языка JavaScript — JQuery, и Symfony — PHP-фреймворк общего назначения, который облегчает взаимодействие с базой данных, задачи формирования HTML-кода и задачи принятия данных из запроса.</li>
				<li>Уметь правильно составлять поисковые запросы, пользоваться качественными и проверенными источниками информации.</li>	
			</ol>
</div>
</div><br><br>
<?php require "document/footer.php" ?>
</body>
</html>