<!DOCTYPE html>
<!-- <html lang="en"> -->
<head>
    <meta charset="UTF-8">
    <meta name="keywords" content="Программист, история программиста, Качества программиста,
     Web-разработчик, Web-дизайнер, HTML, CSS, Javascript, Python, PHP, C++, Mysql, Sql,Как стать программистом" />
    <meta name="description" content="Информационный портал кто такой программист какие языки нужно знать" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="./css/style.css">
    <title>Информационный портал</title>
</head>
<body>
<?php require "document.php/header.php"?>
<div class="container">
    <div class="istoriya">
        <h3>
            История професссии - программист
        </h3>
        <p>
            <strong>
                 Программист
            </strong>
             — это человек, который разрабатывает компьютерные программы 
            и создает их на основе кодов, специальных математических моделей. 
            Программист — специалист, занимающийся непосредственной разработкой 
            программного обеспечения для различного рода вычислительно-операционных систем.
        </p>
        <p>
             Часто первым программируемым устройством принято 
             считать жаккардовый ткацкий станок, построенный в 1804
             году Жозефом Мари Жаккаром, который произвёл революцию в 
             ткацкой промышленности, предоставив возможность программировать 
             узоры на тканях при помощи перфокарт. Первое программируемое вычислительное 
             устройство, Аналитическую машину, разработал Чарлз Бэббидж (но не смог её построить). 
             Первый работающий программируемый компьютер (1941 год), первые программы для него,
             а также (с определёнными оговорками) первый язык программирования высокого уровня
             Планкалкюль создал немецкий инженер Конрад Цузе. Имена людей, впервые начавших 
             профессионально выполнять работу собственно по программированию 
             (в отрыве от наладки аппаратуры компьютера), история не сохранила, 
            так как поначалу программирование рассматривалось как второстепенная наладочная операция.
            В настоящее время ведутся множественные разработки в области вычислительной 
            техники и программирования, и уже достигнуты невероятные успехи. 
            О будущем компьютеризации ведутся оживленные споры среди ученых, но, 
            несомненно, результаты прогресса в этой области превзойдут все наши ожидания.
        </p>
        <h3>
             Качества, обеспечивающие успешность выполнения профессиональной деятельности программиста:
        </h3>
        <table border="1"  cellpadding=0 cellspacing=0>
            <tr><td class="table"><strong>Способности</strong></td><td class="table"><strong>Личностные качества, интересы и склонности</strong></td></tr>
            <tr>
                <td>
                    <ul class="table_links">
                        <li>логическое мышление;</li>
                        <li>гибкость и динамичность мышления;</li>
                        <li>способность анализировать ситуацию (аналитические способности);</li>
                        <li>хороший уровень развития памяти (в особенности словеснологической);</li>
                        <li>высокий уровень развития концентрации, объема, распределения и переключения внимания;</li>
                        <li>способность грамотно выражать свои мысли;</li>
                        <li>высокий уровень развития технических способностей;</li>
                        <li>математические способности;</li>
                        <li>развитое воображение.</li>
                    </ul>
                 </td>
                <td>
                    <ul class="table_links2">
                        <li>внимательность;</li>
                        <li>аккуратность;</li>
                        <li>терпеливость;</li>
                        <li>настойчивость;</li>
                        <li>целеустремленность;</li>
                        <li>ответственность;</li>
                        <li>склонность к интеллектуальным видам деятельности;</li>
                        <li>умение самостоятельно принимать решения;</li>
                        <li>независимость (наличие собственного мнения).</li>
                    </ul>
                </td>
            </tr>
        </table>
        <h3>
            Программистов можно разделить на три категории:
        </h3>
        <p>
            - Прикладные программисты занимаются разработкой программного 
            обеспечения, необходимого для работы организации. Например, 
            сюда можно отнести программистов 1С.
        </p>
        <p>
            - Системные программисты разрабатывают операционные системы,
            интерфейсы к распределенным базам данных, работают с сетями. 
            Специалисты этой категории являются самыми редкими и высокооплачиваемыми.
        </p>
        <p>
            - Web-программисты имеют дело с сетями, но, как правило, 
            с глобальными, такими, как Internet. 
            Они пишут web-интерфейсы к базам данных, создают динамические web-страницы и т.п.
        </p>
        <h3>
            Web-разработчик
        </h3>
        <p>
            <strong>
                Веб-разработчик
            </strong>
             — это специалист занимающийся написанием,
             обновлением, исправлением и совершенствованием алгоритмов для приложений, 
             сайтов и отдельных элементов, с использованием разных языков программирования. 
             Результат работы веб-разработчика — это интуитивно понятные и дружелюбные для 
             пользователя цифровые продукты, которые мы используем в повседневной жизни.
             Профессия веб-разработчика предполагает владение 
             несколькими языками программирования 
             (например, PHP, JavaScript, Ruby, Perl, C++); 
             умение работать с массивными базами данных; знание HTML, CSS, jQuery и т.д. <a href="index2.php">читать подробнее</a>
        </p>
        <h3>
            Web-дизайнер
        </h3>
        <p>
            <strong>Web-дизайнер</strong> – это смесь знаний 
            новейших технологий и умения заинтересовать публику у экранов монитора.
            Для лучшего понимания обозначим, что это ещё одна разновидность дизайна, 
            где главной задачей является создание удобного интерфейса для сайта или
            веб-приложения. Такой человек на «ты» с различными программами, а также
            креативен и не лишён художественного вкуса.Сфера влияния веб-дизайнера
            – это создание и оформление интернет-проектов. Работа считается отлично
            выполненной, если проект набирает стремительную популярность, 
            а также отличается особым удобством при использовании. <a href="index3.php">читать подробнее</a>
        </p>
        <h3>
            Функции программиста
        </h3>
        <p>
            Разрабатывать новые операционные системы, 
            приложения и программы наподобие MS Office или 
            Adobe Photoshop, работая в России, программисту вряд 
            ли придется. Этим занимаются профессионалы высшей квалификации 
            таких иностранных фирм-производителей, как Microsoft, Sun, Oracle, 
            Adobe и других. В отечественных компаниях подобные проекты – редкость, 
            и пользователи, как правило, устанавливают на свои ПК в основном западные 
            продукты. Отдельные российские фирмы-разработчики программного обеспечения 
            существуют, но их немного, например «Лаборатория Касперского», 
            которая выпускает антивирусные программы. Созданием программ занимаются 
            и государственные структуры: НИИ и конструкторские бюро 
            военно-промышленного комплекса, космонавтики, но их крайне мало.
        </p>
        <p>
            В основном в России требуются программисты-
            "прикладники«: практически любая компания сегодня 
            нуждается в автоматизации своего бизнеса, в возможности 
            работать по внутренней компьютерной сети и быстро обмениваться 
            информацией в электронном виде между подразделениями и отделами, 
            вести учет продукции, закупок, реализованного товара.
            Они адаптируют, а если нужно, и разрабатывают пакет 
            специальных программ, учитывая особенности бизнеса организации: 
            одно дело автоматизировать деятельность издательского дома, другое 
            – торговой фирмы или ресторана. Однако многим предприятиям требуется 
            не только автоматизация бизнеса, но и постоянный мониторинг налаженной
            системы, ее изменение в случае расширения компании, поэтому
            работодатели готовы к зачислению программистов к себе в штат. 
            Все же некоторые организации предпочитают заказывать автоматизацию
            своего бизнеса специализированным ИТ-компаниям, предоставляющим такие услуги.
            Способность к самообучению – один из главных навыков, которым должен обладать программист.
        </p>
        <h3>
            Как стать программистом
        </h3>
        <p>
            Получить эту перспективную 
            специальность возможно в вузе. 
            Но в таком образовании есть свои 
            особенности. В институтах делается 
            упор на теорию, а практический опыт 
            студенту нужно нарабатывать самостоятельно. 
            Плюс в этих заведениях много дополнительных 
            предметов, которые не пригодятся в работе будущему программисту.
        </p>
        <p>
             Многие пытаются освоить профессию 
             самостоятельно, однако не все могут должным
              образом структурировать и работать с информацией,
               а значит процесс может затянуться.
        </p>
        <p>
             Но есть более эффективный способ быстро стать
              отличным специалистом и даже найти работу уже 
              во время обучения. Это:
        </p>
        <p>
             Преимущества такого формата обучения очевидны:
        </p>
        <ul>
            <li>
                <strong>вы освоите профессию в максимально короткие сроки — </strong>
                все программы курсов рассчитаны на четкое пошаговое обучение, 
                без ненужной информации, а основное внимание уделяется именно практическим задачам
            </li>
            <li>
                <strong>вы всегда будете иметь обратную связь и поддержку преподавателей — </strong> 
                не нужно самостоятельно искать ответы на вопросы, 
                а ваши домашние задания будут тщательно проверяться и разбираться
            </li>
            <li>
                <strong>вы сможете пройти стажировку на реальных проектах  —</strong>
                 представленные в подборке школы сотрудничают со многими IT-компаниями
            </li>
            <li>
                <strong>вам окажут помощь в трудоустройстве — </strong>
                многие курсы дают такую возможность, 
                консультируют, организовывают собеседования, 
                рекомендуют своим партнерам
            </li>
        </ul>
    </div>
</div>
<div class="footer">
    <div class="header">
         <h4>
             Информационный <br>портал
        </h4>
         <nav>
      <ul class=nav_link>
              <li><a href="index.php">Главная</a></li>
              <li><a href="indexHtml.php">HTML</a></li>
              <li><a href="indexCSS.php">CSS</a></li>
              <li><a href="indexJava.php">Java</a></li>
          </ul>
      </nav>
      <nav>
          <ul class=nav_link>
              <li><a href="indexJavaScript.php">JavaScript</a></li>
              <li><a href="indexPhp.php">PHP</a></li>
              <li><a href="indexPython.php">Python</a></li>
              <li><a href="indexMysql.php">Mysql</a></li>
          </ul>
      </nav>
      <form action="contact.php" method="POST">
            <input type="email" name="email" placeholder="Введите ваш email"><br>
            <input class="knopka" type="submit" submit="отправить">
      </form>
  </div>
</div>
<!-- <script src=./js/script.js></script> -->
<?php require "document.php/footer.php"?>
</body>
</html>