<!DOCTYPE html>
<!-- <html lang="en"> -->
<head>
    <meta charset="UTF-8">
    <meta name="keywords" content="навыки Web-дизайнера,Web-дизайнер,
    веб-дизайнер нужно ли уметь рисовать,С чего начать веб-дизайнеру,Заработки веб дизайнера" />
    <meta name="description" content="Кто такой Web-дизайнер" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="./css/style3.css">
    <title>Информационный портал</title>
</head>
<body>
<?php require "document.php/header.php"?>
<div class="container">
    <div class="istoriya-web">
        <h3>
              Web-дизайнер
        </h3>
        <p>
            <strong>Web-дизайнер –</strong> это смесь знаний новейших 
            технологий и умения заинтересовать публику у экранов монитора.
            Для лучшего понимания обозначим, что это ещё одна разновидность
            дизайна, где главной задачей является создание удобного интерфейса 
            для сайта или веб-приложения. Такой человек на «ты» с различными программами, а
            также креативен и не лишён художественного вкуса.
            Сфера влияния веб-дизайнера – это создание и оформление интернет-проектов. 
            Работа считается отлично выполненной, если проект набирает стремительную популярность,
            а также отличается особым удобством при использовании.
        </p>
        <h3>
            Чем занимается веб-дизайнер
        </h3>
        <p>
            Эта профессия требует хороших усилий, здесь важно упорство. 
            Чтобы овладеть этой специальностью, нужно стремиться постоянно 
            учиться, практиковаться, повышать свои навыки.
        </p>
        <p>
             Любой web-дизайнер должен:
        </p>
        <ul>
            <li>
                уметь работать с различными графическими редакторами;
            </li>
            <li>
                понимать, каким должен быть внешний вид сайтов или блогов;
            </li>
            <li>
                развивать в себе такие способности как: креативность, творческое мышление.
            </li>
            <li>
                немного разбираться в HTML и CSS.
            </li>
        </ul>
        <p>
            В основном веб-дизайнеры создают изображения для блогов, 
            сайтов, страничек в соц. сетях. Нарисованные шапки на
            известных блогах, пабликах соц. сетей, оформление 
            аккаунтов любого интернет-сервиса это дело рук web-дизайнера.
        </p>

        <p>
            Веб-дизайнер должен понимать, что делает верстальщик 
            – человек, который пишет код под нарисованный шаблон.
            Но верстать интернет-страницы ему не обязательно. Его
            основная задача – создавать дизайн, оформлять Интернет-ресурсы.
        </p>
        <h3>
             Должен ли веб-дизайнер уметь рисовать
        </h3>
        <p>
            Есть люди, которые имеют хороший вкус и чувство стиля. Но, 
            они вряд ли нарисуют красивый рисунок рукой. При этом, они 
            умеют создавать классные дизайны, работая в графических редакторах.
            Поэтому, умея работать с графическими редакторами, легко можно делать
            уникальные и привлекательные дизайны для сайтов и блогов, даже не умея рисовать.
        </p>
        <img class="imgg" src="./img/juliya_pervushina_1.jpg" alt="">
        <p>
            Самое главное, что должен уметь специалист в области дизайна
             – это создавать удобный и понятный дизайн, который надолго 
             запомнится пользователям. Если картинка сайта, например, 
             красивая, но сама навигация сложная для пользователей, то 
             это вызовет недовольство, а поэтому сам дизайн уже будет 
             восприниматься по-другому. По этой причине в первую очередь 
             нужно думать об удобстве пользователя и о том, как доставить ему радость.
        </p>
        <h3>
            С чего начать веб-дизайнеру
        </h3>
        <p>
            У начинающего web-дизайнера есть возможность 
            быстро найти работу. Потому как на биржах фриланса 
            очень много заданий. Вначале необходимо подать заявку 
            на выполнение заказа и ждать пока ее одобрят. В дальнейшем,
             когда человек наберется необходимого опыта, заказчики будут 
             сами его искать. Это возможно, если дизайнер будет работать на совесть и качественно.
        </p>
        <p>
            Для начала, будет достаточно знания Adobe Photoshop на
            хорошем уровне. Эта программа удивляет своими возможностями,
            освоение которых потребует времени и сил. Экспериментируйте 
            с цветами, кистями, эффектами. Не обязательно сразу рисовать 
            сайт, важно выработать чувство вкуса и технические навыки при 
            использовании фотошопа.
        </p>
        <img class="img" src="./img/1_fPLZ_zmmiyBxc6Ey09Pg2w.jpeg" alt="">
        <p>
            Без творческих идей и вкуса web-дизайнеру никак. 
            Если природа вас этим обделила, значит, это нужно в 
            себе воспитать. Ходите в кино, фотографируйте, обращайте внимание 
            на рекламу, посещайте выставки, интересуйтесь новинками живописи, 
            покупайте книжки, уделяйте время путешествиям в красивые места. 
            Делайте всё то, что вас вдохновляет на творчество!
        </p>
        <p>
            Купить книжку и освоить работу в программе по книжке – 
            это тоже вариант, но он для самых терпеливых и усидчивых.
            Многие не дойдут и до середины пособия – надоест. 
            Самый простой способ освоить фотошоп, не умея рисовать, 
            пойти учиться на курсы дизайнеров.
        </p>
        <p>
            Там будут учить люди, которые уже работают в программе, 
            и они даже могут поделиться с Вами своими «фишками», а этого 
            в книгах нет. Еще один плюс – после курсов на руках будет документ 
            о том, что Вы учились, а работодатели это ценят.
        </p>
        <h3>
            Навыки и личные качества веб-дизайнера
        </h3>
        <p>
            Главные <strong>навыки:</strong>
        </p>
        <ul>
            <li>умение работать с различными программами по графике;</li>
            <li>наличие отличного художественного вкуса и стиля;</li>
            <li>знание основ юзабилити;</li>
            <li>знание принципов вёрстки и языков HTML, CSS;</li>
            <li>иметь хорошее представление об интернет-маркетинге;</li>
            <li>возможность быть всегда онлайн (если речь идёт о работе на дому).</li>
        </ul>
        <p>
            Главные <strong>качества:</strong>
        </p>
        <ul>
            <li>усидчивость;</li>
            <li>большой запас креативности, идей и умение их воплощать в реальность;</li>
            <li>коммуникативность, умение общаться с заказчиками;</li>
            <li>хорошая память и образное мышление;</li>
            <li>терпеливость, особенно с заказчиками.</li>
        </ul>
        <h3>
             Кому подходит веб дизайн
        </h3>
        <p>
            Ошибочное мнение, что сфера веб дизайна ориентирована 
            исключительно на творческих людей. Мол если вы технарь,
            то в веб дизайн вам лучше не соваться. На самом деле, как
            я уже сказал выше, web design уже давно ушел от творчества 
            в сторону функциональности.
        </p>
        <p>
            Поэтому вам не обязательно быть творческой личностью. 
            Достаточно иметь желание создавать крутые проекты, которыми
            будут пользоваться другие люди. Если вам нравится ощущение того,
            что в какой-то степени вы будете делать виртуальный мир чуточку 
            удобней и привлекательней (путем создания дизайна), тогда это профессия вам подойдет.
        </p>
        <p>
            Еще одним плюсом будет перфекционизм в разумных пределах.
            Внимание к мелочам — это важный аспект любого профессионального
            веб дизайнера, потому что именно из мельчайших деталей складывается общая картина.
        </p>
        <p>
            Помимо этого, аналитический склад ума также добавит вам
            несколько баллов в копилку. Как я уже говорил, создание 
            дизайна базируется в первую очередь на проектировании и 
            определенных исследованиях.
        </p>
        <p>
            Нужно ли высшее профильное образование? Нет. 
            В этой сфере вам достаточно пройти курсы, и вы
            уже сможете претендовать на вакансии. Более того, 
            профильных высших заведений с этим направлением очень 
            мало, и они есть не в каждом городе.
        </p>
        <p>
            По большому счету, веб дизайном может заняться абсолютно любой человек, 
            было бы желание. Большое преимущество этой сферы заключается в том, что 
            можно работать удаленно из любой точки планеты. Это открывает 
            большие возможности в плане заработка и профессионального роста.
        </p>
        <h3>
            Заработки веб дизайнера
        </h3>
        <p>
            Зарплата зависит от того, какой способ заработка
            выбрали. Например, на фрилансе это  могут быть заказы от 
            100 руб до 30 000 руб. за один заказ. На эту цифру влияет опыт 
            работы, а также площадка, где Вы ищите заказчика. Цены у всех разные. 
        </p>

        <p>
            Если решите устроиться на постоянную работу, 
            то там тоже ценник может колебаться в районе 
            35 000 до 300 000 руб. Это зависит от работодателя, 
            его требований, опыта работы дизайнера. Новичок сначала 
            будет зарабатывать в районе 35 000 – 40 000 руб. 
        </p>
    </div>
</div>
<div class="footer">
    <div class="header">
        Информационный <br>портал
      <nav>
      <ul class=nav_link>
              <li><a href="index.php">Главная</a></li><br>
              <li><a href="indexHtml.php">HTML</a></li><br>
              <li><a href="indexCSS.php">CSS</a></li><br>
              <li><a href="indexJava.php">Java</a></li><br>
          </ul>
      </nav>
      <nav>
          <ul class=nav_link>
              <li><a href="indexJavaScript.php">JavaScript</a></li><br>
              <li><a href="indexPhp.php">PHP</a></li><br>
              <li><a href="indexPython.php">Python</a></li><br>
              <li><a href="indexMysql.php">Mysql</a></li><br>
          </ul>
      </nav>
      <form action="contact.php" method="POST">
            <input type="email" name="email" placeholder="Введите ваш email"><br>
            <input class="knopka" type="submit" submit="отправить">
      </form>
  </div>
</div>
<?php require "document.php/footer.php"?>
</body>
</html>